In [67]:
import pandas as pd
df = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [68]:
df

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [69]:
df["col1"].unique()

array([100, 200, 300, 400, 500], dtype=int64)

In [70]:
df["col2"].nunique()

5

In [71]:
df["col1"].value_counts()

300    2
100    1
200    1
400    1
500    1
Name: col1, dtype: int64

In [72]:
df.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [73]:
df["new"] = df["col1"]*10

In [74]:
df

  k1  col1 col2   new
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [75]:
def firstLet(state):
    return(state[0])

In [76]:
firstLet("NY")

'N'

In [77]:
df["first letter"]  = df["col2"].apply(firstLet)

In [78]:
df

  k1  col1 col2   new first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [79]:
def complexLet(state):
    if(state[0] == "W"):
        return "Washington"
    else:
        return("Error")

In [80]:
df["col2"].apply(complexLet)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [81]:
df["k1"]

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [82]:
myMap = {"A": 1, "B": 2, "C": 3}

In [83]:
df["num"] = df["k1"].map(myMap)

In [84]:
df

  k1  col1 col2   new first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [85]:
df["col1"].max()

500

In [86]:
df["col1"].idxmax()

5

In [87]:
df.columns

Index(['k1', 'col1', 'col2', 'new', 'first letter', 'num'], dtype='object')

In [88]:
df.columns = ["C1", "C2", "C3", "C4", "C5", "C6"]

In [89]:
df

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [90]:
df.sort_values("C3", ascending=False)

  C1   C2  C3    C4 C5  C6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

In [91]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [92]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [93]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [94]:
df_feature = pd.concat([features, predictions], axis=1)

In [95]:
df_feature

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

In [96]:
df

  C1   C2  C3    C4 C5  C6
0  A  100  NY  1000  N   1
1  A  200  CA  2000  C   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
4  C  400  AK  4000  A   3
5  C  500  NV  5000  N   3

In [97]:
df["C1"]

0    A
1    A
2    B
3    B
4    C
5    C
Name: C1, dtype: object

In [98]:
pd.get_dummies(df["C1"])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1